var contents = [
    {
      type: "Finance",
      detail: "tax",
      bigHead: "วิธีการคำนวนภาษีเบื้องต้น",
      image: "../images/tax_calculation.png",
      body: "",
      head_h3: "วิธีคำนวณภาษี",
      bodyForH3:
        "ขั้นตอนที่ 1 : ....... </br>เงินได้สุทธิ 0 – 150,000 บาท : อัตราภาษี 0% หรือได้รับการยกเว้นภาษี </br>  ภาษีที่ต้องเสีย = 0 บาท </br> เงินได้สุทธิ 150,000 – 300,000 บาท : อัตราภาษี 5% </br> ภาษีที่ต้องเสีย = [(เงินได้สุทธิ – 150,000) x 0.05] + 0 </br> เงินได้สุทธิ 300,001 – 500,000 บาท : อัตราภาษี 10% </br> ภาษีที่ต้องเสีย = [ (เงินได้สุทธิ – 300,000) x 0.1 ] + 7,500 </br>  เงินได้สุทธิ 500,001 – 750,000 บาท : อัตราภาษี 15% </br> ภาษีที่ต้องเสีย =[ (เงินได้สุทธิ – 500,000) x 0.15 ] + 27,500 </br> เงินได้สุทธิ 750,001 – 1 ล้านบาท : อัตราภาษี 20% </br> ภาษีที่ต้องเสีย = [ (เงินได้สุทธิ – 750,000) x 0.2 ] + 65,000 </br> เงินได้สุทธิ 1,000,001 – 2,000,000 บาท : อัตราภาษี 25% </br> ภาษีที่ต้องเสีย = [ (เงินได้สุทธิ – 1,000,000) x 0.25 ] + 115,000 </br> เงินได้สุทธิ 2,000,001 – 5,000,000 บาท : อัตราภาษี 30% </br> ภาษีที่ต้องเสีย =[ (เงินได้สุทธิ – 2,000,000) x 0.3 ] + 365,000 </br> เงินได้สุทธิมากกว่า 5 ล้านบาท : อัตราภาษี 35% </br> ภาษีที่ต้องเสีย = [ (เงินได้สุทธิ – 5,000,000) x 0.35 ] + 1,265,000",
      head_h4: "",
      bodyForH4: "",
    },
    {
      type: "Finance",
      detail: "invest",
      bigHead: "มือใหม่หัดเริ่มลงทุน",
      image: "../images/inves.jpg",
      body: "",
      head_h3: "มือใหม่! เริ่มอ่าน Fund Fact Sheet อย่างไรดี",
      bodyForH3:
        ": Fund Fact Sheet คือ หนังสือชี้ชวนส่วนสรุปข้อมูลสำคัญของกองทุนรวม </br> &nbsp;ซึ่งจะแสดงข้อมูลสำคัญหลักๆ ของกองทุนไว้ เช่น นโยบายการลงทุน ลักษณะผลตอบแทน </br>&nbsp;ความเสี่ยง และข้อมูลสำคัญที่ควรรู้ทั้งหมดเกี่ยวกับกองทุนรวมนั้นๆ เพื่อเป็นข้อมูลที่ผู้ลงทุน </br>&nbsp;ควรรู้ก่อนที่จะตัดสินใจซื้อกองทุน นั่นเอง",
      head_h4: "โดยหัวข้อใน Fund Fact Sheet ที่เราต้องรู้ มี 5 ประเด็นหลักๆ คือ",
      bodyForH4:
        "1.ดูชื่อ/ประเภทกองทุนรวม และนโยบายการลงทุน -> เพื่อหากองทุนที่ตรงกับเป้าหมายการลงทุนและสไตล์การลงทุนของเรามากที่สุด </br> 2.ดูระดับความเสี่ยงและความผันผวนของกองทุนรวม -> กองทุนแบ่งระดับความเสี่ยงออกเป็น 8 ระดับ โดยความเสี่ยงระดับ 1 คือความเสี่ยงต่ำ และระดับ 8 คือ ความเสี่ยงสูงมาก เราควรเลือกลงทุนกองทุนในระดับความเสี่ยงที่เรายอมรับได้ ดูระดับความเสี่ยงและความผันผวนของกองทุนรวม -> กองทุนแบ่งระดับความเสี่ยงออกเป็น 8 ระดับ โดยความเสี่ยงระดับ 1 คือความเสี่ยงต่ำ และระดับ 8 คือ ความเสี่ยงสูงมาก เราควรเลือกลงทุนกองทุนในระดับความเสี่ยงที่เรายอมรับได้ </br> 3. ดูสัดส่วนของสินทรัพย์ที่ลงทุน (พอร์ตการลงทุน) -> ดูข้อมูลสินทรัพย์ที่กองทุนนำเงินไปลงทุน 5 อันดับแรก เพื่อดูว่ากองทุนลงทุนในสินทรัพย์ตรงกับความต้องการของเราหรือไม่ </br> 4.ดูผลการดำเนินงานย้อนหลัง -> ดูผลการดำเนินงานย้อนหลังของกองทุนตั้งแต่ 3เดือน 6 เดือน 1 ปี 5 ปี 10 ปี หรือตั้งแต่ปีที่จัดตั้งกองทุน </br>ดูค่าธรรมเนียม -> ดูว่ากองทุนเก็บค่าธรรมเนียมอะไรบ้าง มากน้อยแค่ไหน เป็นจำนวนเท่าไร เพื่อนำไปเปรียบเทียบกับกองทุนที่มีนโยบายการลงทุนเหมือนหรือใกล้เคียงกัน ซึ่งค่าธรรมเนียมที่เรียกเก็บก็เป็นอีกปัจจัยหนึ่งที่ส่งผลกระทบกับผลตอบแทนกองทุนในระยะยาวเช่นกัน",
    },
    {
      type: "Healthy",
      detail: "FirstAid",
      bigHead: "การปฐมพยาบาลเบื้องต้น",
      image: "../images/FirstAid.jpg",
      body: "",
      head_h3: "ข้อเท้าพลิก..ต้องทำยังไง !?",
      bodyForH3: "",
      head_h4:
        "กับหลักการจำง่ายๆ 'R.I.C.E' หลักการปฐมพยาบาลเบื้องต้นเมื่อข้อเท้าแพลง",
      bodyForH4:
        "&nbsp; - Rest : พักหยุดใช้งานส่วนของร่างกายที่ได้รับบาดเจ็บทันที โดยเฉพาะช่วง 6 ชั่วโมงแรกของการบาดเจ็บ การบาดเจ็บจากการเล่นกีฬาหรือออกกำลังกายต้องการเวลาพักประมาณ 48 ชั่วโมง ก่อนจะเริ่มเคลื่อนไหวอีกครั้ง </br> &nbsp;I - ICE : ประคบเย็นเพื่อลดบวม โดยประคบเย็นประมาณ 15 นาที ทุก ๆ 2 ชั่วโมง ข้อห้ามคือไม่ควรประคบร้อนหรือนวดบริเวณที่เกิดการบาดเจ็บในระยะแรก </br> &nbsp;C - Compression : รัดใช้ผ้าพันบริเวณที่บวมและพยายามไม่เคลื่อนไหวถ้าไม่จำเป็น เพราะจะทำให้ปวดในบริเวณที่ได้รับบาดเจ็บ </br>&nbsp; E- Evaluation : ยกสูงยกขาให้สูงขึ้น เพื่อลดบวมและลดความเจ็บปวด ",
    },
    {
      type: "Healthy",
      detail: "Stress",
      bigHead: "วิธีการจัดการความเครียด",
      image: "../images/Stress.jpg",
      body: "",
      head_h3: "มัดรวม! 5 วิธีการจัดการความเครียด",
      bodyForH3:
        "&nbsp; 1. ฝึกรับมือกับความเครียด + จดเรื่องราวดีดีในแต่ละวัน </br>&nbsp; 2.พูดคุย ระบายกับคนที่ไว้ใจ หรือเขียนลงไดอารี่ </br>&nbsp; 3. ไม่เก็บเรื่องงานมาคิดตลอดเวลา ให้เวลาตัวเองพักผ่อน </br>&nbsp; 4. ปรับเปลี่ยนพฤติกรรมให้ดีขึ้น ทั้งร่างกาย + จิตใจ เช่น ออกกำลังกาย </br>&nbsp; 5. หาวิธีเบนออกจากความเครียด เช่น ดูหนัง ฟังเพลง",
      head_h4: "",
      bodyForH4: "",
    },
    {
      type: "Healthy",
      detail: "Organ",
      bigHead: "8 อวัยวะนี้ กลัวอะไร?",
      image: "../images/Organ.jpg",
      body: "",
      head_h3: "อวัยวะเหล่านี้ กลัวอะไรกันบ้าง!?",
      bodyForH3:
        "&nbsp;หัวใจ >> กลัวความเค็ม </br>&nbsp;ตับ >> กลัวเหล้า </br>&nbsp;ไต >> กลัวความกระหาย </br>&nbsp;ปอด >> กลัวบุหรี่ </br>&nbsp;ถุงน้ำดี >> กลัวน้ำมัน </br>&nbsp;ตับอ่อน >> กลัวการกินจุก </br>&nbsp;ลำไส้ >> กลัวการนั่งn</br>&nbsp;กระเพาะ >> กลัวอิ่ม",
      head_h4: "",
      bodyForH4: "",
    },
    {
      type: "Healthy",
      detail: "SkinHealth",
      bigHead: "สุขภาพผิวดี ทำง่ายง่าย ด้วยตัวเอง!",
      image: "../images/SkinHealth.jpg",
      body: "",
      head_h3: "มาดูแลสุขภาพผิวกัน !",
      bodyForH3:
        "&nbsp;1. Sleep : นอนพักผ่อนให้เพียงพอ คือดีที่สุดดดด ผิวดีง่ายๆ หลับสนิท 7-8 ชม. สภาพบรรยากาศดี </br>&nbsp;2. Workout : เดินทุกวัน อย่างน้อย 30 นาที ออกกำลัง 20-40 นาที (สัปดาห์ละ 2-4 ครั้ง) </br>&nbsp;3. Drink water : ดื่มน้ำให้ได้วันละ 8 แก้ว หรือ 2 ลิตร (ทริคดื่มน้ำบ่อยๆ คือค่อยๆจิบ หรือเลือกเป็นน้ำหมักผลไม้ก็ได้)",
      head_h4: "อาหารที่กินแล้วผิวดี",
      bodyForH4:
        "&nbsp; 1. ผลไม้ ผักใบเขียว (มะเขือเทศคือที่สุด) </br>&nbsp; 2. ถั่ว เมล็ดอัลมอนต์ถั่วเหลือง </br>&nbsp; 3. ชาเขียว (หลีกเลี่ยงกาแฟ หรือเครื่องดื่มที่ใส่นมจากสัตว์)n</br>&nbsp; 4. โปรตีนจากไข่ ปลา (แซลม่อนคือดี)",
    },
    {
      type: "Communication",
      detail: "WriteEmail",
      bigHead: "ทักษะในการเขียนอีเมลเบื้องต้นในภาษาอังกิด",
      image: "/images/WriteEmail.jpg",
      body: "",
      head_h3: "มัดรวม ประโยคภาษาอังกฤษปัง ๆ สำหรับการเขียนอีเมล",
      bodyForH3:
        "&nbsp; 1. การใช้คำขึ้นต้น : Dear + ชื่อผู้รับ, เช่น Dear Mr:Sam, </br>&nbsp; 2. การใช้ประโยคขึ้นย่อหน้าแรก : สามารถเขียนว่า I hope this message finds you well. เพื่อถามว่าคนรับสบายดีไหม ก่อนที่จะเข้าเรื่อง (การถามเพื่อเป็นมารยาท) </br>&nbsp; 3. การใช้ประโยคในเนื้อหาเพื่อเข้าเรื่อง : สามารถเขียนว่า l am writing to + Verb infinitive เช่น I am writing to let you know that… </br>&nbsp; 4. การใช้ประโยคในเนื้อหาเพื่อเตือนการประชุม : สามารถเขียนว่า This message is a friendly reminder to save the date </br>&nbsp; 5. การใช้ประโยคก่อนลงท้าย : </br>&nbsp; &nbsp; • เมื่อต้องการขอความเห็น : I am looking forward to hearing your ideas/thoughts. </br>&nbsp; &nbsp; • เมื่อต้องการให้คอนเฟิร์มวันนัดหมาย : Please RSVP by June 01st. </br>&nbsp; &nbsp; • เมื่อต้องการเปิดโอกาสให้ซักถามเพิ่มเติม : Please let me know if you have further questions. </br>&nbsp; 6. การใช้คำลงท้าย : </br>&nbsp; Best regards, </br>&nbsp; ชื่อคนส่ง </br>&nbsp; เช่น </br>&nbsp; Best regards, </br>&nbsp; Paul",
      head_h4: "",
      bodyForH4: "",
    },
    {
      type: "Communication",
      detail: "Vocab",
      bigHead: "สำนวนภาษาอังกฤษน่ารู้ ได้ใช้บ่อยแน่!",
      image: "/images/Vocab.jpg",
      body: "",
      head_h3: "จดเลย! 8 สำนวนภาษาอังกฤษในชีวิตประจำวัน",
      bodyForH3:
        "&nbsp; 1. Way to go = เยี่ยมมาก เก่งมาก </br>&nbsp; 2. I'm on the fence = ฉันลังเล </br>&nbsp; 3. So far, so good = จนถึงตอนนี้ก็ดีไม่มีปัญหาอะไร </br>&nbsp; 4. what do you say? = คุณคิดว่าไง </br>&nbsp; 5. I'll cut to the chase. = ฉันจะพูดเข้าประเด็นเลยนะ </br>&nbsp; 6. I feel you = ฉันเข้าใจคุณนะ </br>&nbsp; 7. I'm heading out = ฉันกำลังออกไป </br>&nbsp; 8. The ball is in your court = แล้วแต่คุณเลย",
      head_h4: "",
      bodyForH4: "",
    },
    {
      type: "Communication",
      detail: "HowtoSpeak",
      bigHead: "เทคนิคการพูดจาโน้มน้าวใจ",
      image: "/images/HowtoSpeak.jpg",
      body: "",
      head_h3: "เทคนิคการพูดจาโน้มน้าวใจ",
      bodyForH3:
        "&nbsp; การพูดโน้มน้าวใจนั้น เป็นการพูดเพื่อให้ผู้ฟังเกิดความคล้อยตามในสิ่งที่เราพูด เปรียบเสมือนเป็นการพูดเกลี้ยกล่อม ชักจูง ให้เกิดความรู้สึกที่เห็นด้วย มีทัศนคติและแนวทางเดียวกับผู้พูดนั่นเอง โดยเทคนิคการพูดโน้มน้าวใจ มีดังนี้",
      head_h4: "",
      bodyForH4:
        "&nbsp; 1. สร้างบรรยากาศให้เกิดความรู้สึกร่วม : เป็นการเร้าให้เกิดอารมณ์ ให้ผู้ฟังรู้สึกอินและสัมผัสถึงความรู้สึกเข้าใจในสถานการณ์ที่ผู้พูดได้พูดออกมา </br>&nbsp; 2. ความน่าเชื่อถือของผู้พูด : การที่ผู้พูดเป็นคนมีภูมิฐาน และบุคลิกภาพดีก็เป็นสิ่งที่ทำให้ผู้ฟังให้ความเคารพและให้ความเชื่อถือศรัทธาได้ </br>&nbsp; 3. พูดด้วยหลักการและเหตุผล : การพูดด้วยทักษะความรู้ต่างๆพร้อมอ้างอิงแหล่งข้อมูลที่น่าเชื่อถือ ทำให้ผู้ฟังเกิดความรู้สึกมั่นใจและชื่นชมในตัวของผู้พูด </br>&nbsp; 4. การแสดงให้เห็นทางเลือกทั้งข้อดีและข้อเสีย : ไม่เป็นการขายในสิ่งที่เราต้องการจะสื่อสารเกินไป ต้องค่อยๆใช้ทักษะลีลาในการให้ผู้ฟังเกิดความรู้สึกสนใจและอยากเข้าร่วม </br>&nbsp; 5. ผู้พูดต้องมีความมั่นใจ : ผู้พูดนั้นต้องเชื่อมั่นในตัวเองและสิ่งที่ตัวเองได้พูดออกมาต้องมีความหนักแน่น ไม่ประหม่าหรือเกิดความลังเลในการพูด </br>&nbsp; 6. การใช้โทนเสียง : ควรเลือกใช้โทนเสียงให้น่าฟัง โดยอาจจะมีการแทรกกิจกรรมต่างๆระหว่างผู้พูดกับผู้ฟังเพื่อการมีส่วนร่วมระหว่างกัน หลีกเลี่ยงการใช้คำพูดในเชิงข่มขู่ </br>&nbsp; 7. การกำหนดจุดมุ่งหมายในการพูดให้ชัดเจน : เป็นการกำหนดทิศทางว่าเราจะพูดไปทางไหน บอกสโคปคร่าวๆแก่ผู้ฟัง แล้วค่อยพูดปูเรื่องต่างๆในเรื่องที่เราต้องการจะ ",
    },
    {
      type: "Socializing",
      detail: "Courtesy",
      bigHead: "มารยาทตามหลักสากล",
      image: "/images/Courtesy.jpg",
      body: "",
      head_h3: "13 มารยาทในสังคม ที่เราควรมี",
      bodyForH3:
        "&nbsp; 1. ยืมเงินหรือของใครมา ต้องคืนให้เร็ว แสดงให้เห็น ว่าเรามีความซื่อสัตย์และเป็นเครดิตให้ตัวเอง </br>&nbsp; 2. ถ้ามีใครเลี้ยงอาหาร อย่าสั่งเมนูแพงๆ </br>&nbsp; 3. อย่าโทรหาใครเกินสองครั้งติด ถ้าเขาไม่รับสายให้คิดว่าเขาติดธุระสำคัญอยู่ </br>&nbsp; 4. อย่าถามคำถามที่น่าอึดอัด เช่น ทำไมยังไม่แต่งงานทำไมยังไม่มีลูก เพราะไม่ใช่เรื่องของคุณ </br>&nbsp; 5. เปิดประตูเผื่อให้คนที่เดินตามหลังมาด้วยเป็นมารยาทในการปฏิบัติต่อผู้อื่นในที่สาธารณะ </br>&nbsp; 6. เวลาใครพูด อย่าขัดจึงหวะ </br>&nbsp; 7. ถ้าแหย่ใครเล่น แล้วเขาไม่ชอบ ก็เลิกเล่นซะแล้วอย่าทำอีก </br>&nbsp; 8. เวลามีใครช่วย อย่าลืมพูด 'ขอบคุณ' </br>&nbsp; 9. ชื่นชมคนอื่นต่อหน้าธารกำนัลได้ แต่ถ้าจะวิจารณ์คนอื่นให้ไปพูดตัวต่อตัว </br>&nbsp; 10. อย่าพูดถึงน้ำหนักตัวของใคร แค่บอกว่า เขาดูดีถ้าเขาอยากคุยเรื่องลดน้ำหนัก เขาจะพูดเอง </br>&nbsp; 11. ถ้าคนอื่นให้ดูรูปในโทรศัพท์ อย่าปิดหน้าจอไปดูรูปอื่น </br>&nbsp; 12. ถ้าใครกำลังคุยด้วย อย่าเอาแต่กมหน้ามองโทรศัพท์ เพราะเสียมารยาทมาก </br>&nbsp;13. อย่ายุ่งเรื่องคนอื่น ถ้าไม่มีอะไรเกี่ยวข้องกับเรา",
      head_h4: "",
      bodyForH4: "",
    },
    {
      type: "Socializing",
      detail: "Social",
      bigHead: "วิธีสร้างความมั่นใจให้คนขี้อายกล้าเข้าสังคม",
      image: "/images/Social.jpg",
      body: "",
      head_h3: "วิธีเข้าสังคมฉบับ คนโลกส่วนตัวสูงชอบอยู่คนเดียว!",
      bodyForH3:
        "ทุกๆคนเจอปัญหานี้อยู่หรือเปล่าคะ ที่ไม่ค่อยกล้าเข้าสังคมใหม่ๆ เรามีวิธีที่สามารถผ่านมันมาได้ ไปดูกันเลย !",
      head_h4: "",
      bodyForH4:
        "&nbsp; 1. เริ่มทุกอย่างด้วยรอยยิ้ม จริงๆแล้วการยิ้มเป็นอะไรที่ดีที่สุดไม่ว่าจะในสถานการณ์อะไรแบบไหนก็ตามเป็นสิ่งที่ง่ายที่สุดเลย! </br>&nbsp; 2. อาจจะลองปรับเปลี่ยนความคิดดูทัศนคติ ถ้าใจเรายังไม่กล้าและยังคิดว่าตัวเองทำไม่ได้อาจจะทำให้เราไม่กล้าตลอดไป ลองปรับลองเปลี่ยนแล้วค่อยๆเริ่มทำเพราะทัศนคติเป็นสิ่งสำคัญในการเริ่มเข้าสังคมมากที่สุดเลยนะ ! </br>&nbsp; 3. ให้ความสำคัญกับคนตรงหน้าละสายตาจากหน้าจอโทรศัพท์ให้มาก เพราะการที่เรามีส่วนร่วมกับสิ่งตรงหน้าจะทำให้เราได้รู้และเข้า สังคมได้ง่ายขึ้น  </br>&nbsp; 4. ลองเป็นฝ่ายเริ่มบทสนทนาก่อน การที่เราเริ่มพูดคุยขึ้นก่อนชวนคุยก่อนจะเป็นการสร้างบรรยากาศโดยรวมให้ดีขึ้นไม่รู้สึกถึงความเงียบแล้วทำให้เราอึดอัดอีก </br>&nbsp; 5. ลองใช้ชีวิตในแบบที่แปลกใหม่ให้แตกต่างจากที่เราเคยเป็นอยู่เพราะจะทำให้การเข้าสังคมของเราเป็นเรื่องที่ง่ายมากขึ้นเลยมันทำให้เรากล้าที่จะลองทำ หรือกล้าที่จะลองคุยกับคนใหม่ๆ !</br> สุดท้ายแล้ว ..ขอเป็นกำลังใจให้ทุกคนเพราะเราก็เป็นหนึ่งในคนที่โลกส่วนตัวสูงไม่ค่อยกล้าที่จะเข้าสังคมใหม่ๆเท่าไหร่เราจะประหม่าและกังวลเวลาต้องเริ่มเข้าไปในสังคมใหม่ๆอยู่เสมอเลยนะคะ :)",
    },
    {
      type: "Food",
      detail: "Menu",
      bigHead: "เมนูมื้อเย็น ช่วงลดน้ำหนัก",
      image: "/images/Menu.jpg",
      body: "",
      head_h3: "7 เมนูมื้อเย็น ช่วงลดน้ำหนัก 7 วัน 7 เมนู อร่อยไม่ซ้ำ !",
      bodyForH3:
        "&nbsp; 1. โจ๊กข้าวโอ๊ตหมูสับ </br>&nbsp; 2. น้ำตกหมู </br>&nbsp; 3. หมูผัดกิมจิ </br>&nbsp; 4. สันในไก่ย่างน้ำจิ้มซีฟู้ด </br>&nbsp; 5. ต้มจืดอกไก่บด </br>&nbsp; 6. ลวกจิ้ม </br>&nbsp; 7. หมูสับกระเทียมไข่ข้น",
      head_h4: "ทริคเล็กๆควรรู้",
      bodyForH4:
        "&nbsp; - กินมื้อเย็นก่อนเข้านอน 4-6 ชั่วโมง </br>&nbsp; - เลือกอาหารย่อยง่าย เช่น ปลา ไข่ เต้าหู้ ผัก </br>&nbsp; - เคี้ยวให้ละเอียด </br>&nbsp; - ไม่กินจนจุกแน่นเกินไป </br>&nbsp; - มื้อเย็นไม่จำเป็นต้องงด กินมื้อเย็นทุกวันก็ลดได้เหมือนกัน แค่ต้องเรื่องสารอาหารที่ดี ย่อยง่าย และดูเรื่องเวลาให้ย่อยทันก่อนเข้านอนจะได้ไม่มีปัญหาสุขภาพที่หลังค่า",
    },
    {
      type: "Food",
      detail: "Nutrient",
      bigHead: "สารอาหารที่จำเป็นต่อร่างกาย",
      image: "/images/Nutrient.jpg",
      body: "",
      head_h3: "อาหาร 9 ชนิด ที่ควรกินทุกวัน !",
      bodyForH3:
        "&nbsp; นอกจากการทานอาหารครบ 5 หมู่แล้ว ควรต้องรับทานอาหารที่มีประโยชน์ในทุกวัน จะยิ่งทำให้คุณมีสุขภาพที่ดีเพิ่มขึ้น </br></br>&nbsp; 1. ปลา : นอกจากให้โปรตีนสูง ยังมีโอเมก้า 3 ซึ่งก็คือกรดไขมันจำเป็น ที่ร่างกายขาดไม่ได้ ช่วยลดระดับคอเลสเตอรอลไม่ดี  </br>&nbsp; 2. ไข่ไก่ : เป็นแหล่งของโปรตีนคุณภาพสูง ทำให้คุณได้พลังงานแต่ไม่อ้วน มีประโยชน์ในการบำรุงสายตา </br>&nbsp; 3. ถั่วทุกชนิด : ถั่วนอกจากจะให้โปรตีนที่สูงแล้ว ยังเป็นแหล่งของเหล็ก ซึ่งเป็นสารอาหารที่ช่วยในการส่งผ่านออกซิเจนจากปอดไปยังเซลล์ต่าง ๆ ของ ร่างกาย </br>&nbsp; 4. ส้ม : เป็นผลไม้ให้วิตามิน C คุณภาพสูง ดีต่อการสร้างเซลล์เม็ดเลือดขาว ช่วยสร้างภูมิต้านทานโรค มีไฟเบอร์สูง เป็นแหล่งของแอนตี้อ๊อกซิแดนท์ </br>&nbsp; 5. คะน้า : สารเบต้าแคโรทีนสูงในผักคะน้า ช่วยลดความเสี่ยงต่อการเกิดมะเร็งกระเพาะอาหาร มะเร็งลำไส้ มะเร็งปอด มีวิตามินที่ช่วยเสริมสร้างกล้ามเนื้อ สร้างภูมิต้านทานโรคที่ดี </br>&nbsp; 6. บร็อคโคลี่ : แหล่งวิตามินซี เอ และเค บร็อคโคลี่มีเบต้าแคโรทีนสูง ช่วยในการบำรุงสายตา </br>&nbsp; 7. มันเทศ :เป็นแหล่งเบตาแคโรทีนชั้นดีช่วยเสริมสร้างระบบภูมิคุ้มกัน บำรุงสายตา ทำให้ตับอ่อนแข็งแรง มีสารต้านอนุมูลอิสระ มีวิตามินบี 5 บี 6 ส่งผลโดยตรงกับการลดน้ำหนัก  </br>&nbsp; 8. โยเกิร์ต : ในโยเกิร์ต มีโพแทสเซียม ฟอสฟอรัส สังกะสี วิตามินบี 12 และโปรตีน ควรทานโยเกิร์ตให้ได้วันละ 1 ถ้วย จะทำให้สุขภาพดีขึ้นแน่นอน </br>&nbsp; 9. ชา : การดื่มชาในปริมาณที่พอเหมาะ ช่วยลดความเสี่ยงต่อการเป็นอัลไซเมอร์ มะเร็ง และทำให้สุขภาพฟันและกระดูกแข็งแรงขึ้น",
      head_h4: "",
      bodyForH4:
        "&nbsp; ประโยชน์มากมายแบบนี้ คนรักสุขภาพไม่ควรพลาดเลยน๊า อาหารแต่ละมื้อของคุณ อย่าลืมเลือกวัตถุดิบมากประโยชน์เหล่านี้มาปรุง รับประทานด้วยนะคะ ที่สำคัญควรเลือกวัตถุดิบที่สดใหม่ และทานอาหารที่ปรุงสุกเสมอ เพื่อสุขภาพที่ดีได้ประโยชน์จากอาหารอย่างเต็มที่",
    },
    {
      type: "Learning",
      detail: "GraphSum",
      bigHead: "กราฟคืออะไร",
      image: "../images/GraphSum.png",
      body: "",
      head_h3: "มารู้จักกับกราฟกัน คืออะไร และมีประโยชน์อย่างไรกันนะ?",
      bodyForH3:
        "&nbsp; กราฟ เป็นการแสดงผลของเซตของจุดที่แสดงผลอย่างเป็นระเบียบ จัดเป็นแผนภูมิประเภทหนึ่งที่ทำให้เราสามารถวิเคราะห์ข้อมูลต่าง ๆ ได้อย่างเห็นภาพ และสะดวกรวดเร็วมากขึ้น ยิ่งไปกว่านั้นคือกราฟยังช่วยให้เราสามารถแก้ระบบสมการที่สลับซับซ้อนได้อีกด้วย </br> <i>กราฟเส้นตรงคืออะไร?</i> </br>&nbsp; กราฟเส้นตรง คือ กราฟที่เขียนในรูปของ  Ax + By + C = 0 </br>&nbsp; สมการเส้นตรงในรูป Ax + By + C = 0 สมการนี้สามารถเขียนในอีกรูปคือ y = mx + c </br>&nbsp; ซึ่ง m = ความชัน และ c = ระยะตัดแกน  y (Y – Intercept) </br> <i>มารู้จัก 'จุดตัดแกน x' และ 'จุดตัดแกน y'</i> </br>&nbsp; จุดตัดแทน x ให้ y = 0 และจุดตัดแกน y ให้ x = 0 </br> <i>ความชันกราฟ</i> </br>&nbsp; - ความชัน = 0 -> เส้นตรงทำมุมกับแกน x = 0 องศา </br>&nbsp; - ความชัน > 0 -> เส้นตรงทำมุมกับแกน x เป็นมุมแหลม ความชัน < 0 -> เส้นตรงทำมุมกับแกน x เป็นมุมป้าน </br> <i>ความชันของเส้นตรง 2 เส้น</i> </br>&nbsp; - ถ้า m1 x m2 = -1 -> หมายถึงเส้นตรงทั้งสองตั้งฉากกัน </br>&nbsp; - ถ้า m1 = m2 -> หมายถึงเส้นตรงทั้งสองขนานกัน",
      head_h4: "",
      bodyForH4: "",
    },
    {
      type: "Learning",
      detail: "Grade4",
      bigHead: "เรียนยังไง ให้ได้ 4.00",
      image: "/images/Grade4.jpg",
      body: "",
      head_h3: "เรียนยังไงให้ให้ได้ 4.00 ฉบับคนขี้เกียจ",
      bodyForH3:
        "&nbsp; 1. ฟังตอนครูสอน : พยายามฟังให้มากที่สุด *ไม่คุยกับเพื่อนในคาบ คุยแค่ตอนจำเป็น ไม่งั้นเราจะหลุดไปเลย </br>&nbsp; 2. ส่งงานให้ครบ : เราต้องพยายามส่งงานให้ครบ เพราะคะแนนเก็บนั้นสำคัญมาก </br>&nbsp; 3. ตั้งเป้าหมายกับหารเรียน : การตั้้งเป้าหมายจะทำให้เราไม่วแกแวก และโฟกัสกับการเรียนได้ดีขึ้น เช่น เช่น อยากได้เกรด 3.90+ เพื่อที่จะได้เรียนฟรี , อยากเก่งให้ได้เท่ากับคนคนนั้นของเธอ </br>&nbsp; 4. รู้จักถามหรือหาข้อมูล : ถ้าเราสงสัยอะไรหรือไม่แน่ใจสิ่งไหน ให้เราถามเพื่อน, คุณครู, หาข้อมูลบนอินเทอร์เน็ต กระจะได้กระจ่างและมั่นใจในคำตอบมากขึ้น",
      head_h4: "",
      bodyForH4: "",
    },
    {
      type: "Manage",
      detail: "ManageTime",
      bigHead: "เคล็ดลับการบริหารเวลา",
      image: "/images/ManageTime.jpg",
      body: "",
      head_h3: "ฮาวทู จัดการงานท่วมหัว !!",
      bodyForH3:
        "เคยไหม? ที่รู้สึกว่าตัวเองมีหลายสิ่งหลายอย่างต้องทำ จนไม่มีเวลาว่างได้ใช้ชีวิต หรือไม่มีเวลาหันกลับมาดูแลตัวเอง ",
      head_h4:
        "มาลองทำ 7 ข้อนี้กัน รับรองว่า ช่วยให้คุณสามารถจัดการเวลาชีวิตได้ดีขึ้นแน่นอน",
      bodyForH4:
        "&nbsp; 1. จัดการความยุ่งเหยิงในสมองของคุณ ถ้าความคิดหรือไอเดียของคุณกำลังฟุ้งกระจายเต็มไปหมดในหัวของคุณลองเขียนสิ่งเหล่านั้นออกมาสิ แล้วคุณจะเห็นความคิดได้ชัดเจนมากขึ้นเมื่อคุณเห็นความคิดชัดมากขึ้น </br>&nbsp; 2. จัดประเภทของงาน นั่งคิดวิเคราะห์และจัดลำดับความสำคัญของงานออกมา และเลือกทำอันที่สำคัญที่สุดก่อน </br>&nbsp; 3. จัดระเบียบสิ่งแวดล้อมรอบตัว สิ่งแวดล้อมรอบตัวในการทำงาน มีผลต่อสมาธิในการทำงานของคุณกำจัดสิ่งที่รบกวนสมาธิ หรือไม่มีประโยชน์ต่อการทำงานออกไปก่อน </br>&nbsp; 4. หยุดจิตที่ฟุ้งซ่านนั่นก่อน ตัวการร้ายที่ทำให้งานเสร็จช้า คือใจที่ล่องลอย บางคนใจลอย เอาตัวเองอยู่กับจินตนาการในหัว รู้ตัวอีกทีก็ผ่านไป 1 ชั่วโมง โดยที่ไม่ได้ลงมือทำอะไรเลย </br>&nbsp; 5. พักเป็นช่วงๆ การทำบางสิ่งบางอย่างต่อเนื่องมากเกินไป อาจมีข้อเสียมากกว่าข้อดีการหยุดพักเป็นช่วงๆ จะช่วยให้คุณสดชื่นมากขึ้น และยังช่วยให้คุณมีสมาธิมากขึ้นอีกด้วย </br>&nbsp; 6. พลังงานของการโฟกัสปัจจุบัน ไม่ว่าคุณจะอยู่ที่ไหน จงทำให้ตัวเองมั่นใจว่าคุณอยู่ ณ จุดๆนั้นจริงๆปล่อยวางจากอดีต เพื่อที่มันจะได้ไม่มาทำลายปัจจุบันและอนาคตของคุณ </br>&nbsp; 7. เอาชนะการผัดวัน เชื่อเถอะว่าการผัดวันหรือเลื่อนการลงมือทำสิ่งที่สำคัญ ทำให้เกิดความกังวลและความเครียดมากขึ้น จงลงทำมือตั้งแต่เนิ่นๆ จะได้ไม่ไปเครียดหรือทำงานลวกๆตอนหลัง",
    },
    {
      type: "Manage",
      detail: "Plan",
      bigHead: "แชร์วิธีทำแพลนเที่ยว",
      image: "/images/Plan.jpg",
      body: "",
      head_h3: "วิธีการทำแพลนเที่ยว ฉบับเข้าใจง่าย ไม่ปวดหัว",
      bodyForH3:
        "&nbsp; 1. กำหนดที่ที่จะไป -> </br>&nbsp;&nbsp; - ลิสต์รายชื่อสถานที่ </br>&nbsp;&nbsp; - ระบุที่ตั้ง </br>&nbsp;&nbsp; - ต้องจัดลำดับความอยากไป </br>&nbsp; 2. จัดกลุ่มจากที่ตั้ง </br>&nbsp;&nbsp; - เสิร์ชชื่อสถานที่ในแมพ </br>&nbsp;&nbsp; - ดูว่าส่วนไหนอยู่โซนไหน เพื่อเลือกที่พักให้ใกล้กับที่เที่ยวส่วนใหญ่จะไป </br>&nbsp; 3. วันเที่ยวไกล (ควรไว้วันกลางๆ เพราะวันแรกกับวันท้ายจะเร่งรีบและเหนื่อยเกินไป) </br>&nbsp;&nbsp;- ไปเที่ยวจุดที่ไกลที่สุด และเที่ยวในระแวกนั้นไปเลย </br>&nbsp;&nbsp; - ไม่ต้องย้อนไปมา เก็บหมดในรอบเดียว </br>&nbsp; 4. วันเที่ยวใกล้ (ไว้วันแรก,วันท้าย เพราะไม่เหนื่อยมาก และไม่ต้องรีบด้วย) </br>&nbsp;&nbsp; - ไปเที่ยวในระแวกที่พักได้เลย </br>&nbsp;&nbsp; - เดินทางง่าย ทำเวลาได้ ไม่ยมมาก </br>&nbsp;&nbsp;- ให้เวลาส่วนนี้เยอะหน่อย เพราะเราเลือกที่พักใกล้ที่เที่ยวส่วนใหญ่ไง",
      head_h4: "",
      bodyForH4: "",
    },
    {
      type: "Other",
      detail: "Law",
      bigHead: "กฎหมายเบื้องต้น",
      image: "/images/Law.jpg",
      body: "",
      head_h3: "กฎหมายที่ควรรู้ที่เกี่ยวข้องในชีวิตประจำวัน",
      bodyForH3:
        "&nbsp; กฎหมาย คือ ข้อบังคับ กติกาของรัฐหรือของชาติ กำหนดขึ้นมาเพื่อใช้บังคับ ควบคุม ความประพฤติของบุคคลในสังคม ให้ปฏิบัติตาม หากมีการฝ่าฝืน ไม่ปฏิบัติตามจะมีความผิดและได้รับโทษตามที่กำหนดไว้",
      head_h4: "",
      bodyForH4:
        "&nbsp;1. กฎหมายรัฐธรรมนูญ เป็นกฎหมายสูงสุดในการปกครองประเทศ เป็นการกำหนดสิทธิ เสรีภาพ หน้าที่ของบุคคล </br>&nbsp;&nbsp; - สิทธิ หมายถึง ประโยชน์ซึ่งกฎหมายรับรอง คุ้มครองให้กับบุคคล </br>&nbsp;&nbsp; - เสรีภาพ หมายถึง การกระทำของบุคคลที่ไม่ขัดต่อกฎหมาย </br>&nbsp;&nbsp; - หน้าที่ คือ สิ่งที่บุคคลจะต้องกระทำหรืองดเว้นกระทำ ในฐานะสมาชิกของรัฐ </br>&nbsp; 2. กฎหมายเลือกตั้ง เป็นกฎหมายที่บัญญัติขึ้นเพื่อควบคุมการจัดและดำเนินการเลือกตั้งให้เป็นไปโดยเรียบร้อยและยุติธรรม </br>&nbsp; 3. กฎหมายเกี่ยวกับทะเบียนราษฎร์ </br>&nbsp;&nbsp; - เมื่อมีคนเกิดต้องแจ้งต่อนายทะเบียนภายใน 15 วัน   </br>&nbsp;&nbsp; - เมื่อมีคนตายต้องแจ้งต่อนายทะเบียนภายใน 24 ชม. </br>&nbsp;&nbsp; - เมื่อย้ายที่อยู่อาศัยต้องแจ้งภายใน 15 วัน </br>&nbsp; 4. กฎหมายเกี่ยวกับบัตรประชาชน    </br>&nbsp;&nbsp; - การเปลี่ยนชื่อตัว – ชื่อสกุล ต้องขอทำบัตรใหม่ภายใน 60 วัน  </br>&nbsp;&nbsp; - บัตรสูญหายต้องขอเปลี่ยนใหม่ ภายใน 60 วัน   </br>&nbsp;&nbsp; - บคคลที่ไม่ต้องมีบัตรประชาชน ได้แก่ พระภิกษุ ข้าราชการ นักโทษ และบุคคลที่มีอายุเกิน 70 ปี ขึ้นไป </br>&nbsp; 5. กฎหมายเกี่ยวกับการรับราชการทหาร   </br>&nbsp;&nbsp; - ชายไทยที่มีสัญชาติไทย อายุย่างเข้า 18 ปีบริบูรณ์ ให้ไปแสดงตัวเพื่อลงบัญชีพลทหารกองเกินภายในเขตภูมิลำเนาของตน   </br>&nbsp;&nbsp; - เมื่ออายุย่างเข้า 21 ปี ต้องไปแสดงตนเพื่อรับหมายเรียกและต้องทำการตรวจเลือกเพื่อเข้าเป็นทหารกองประจำการตามกำหนดนัด </br>&nbsp; 6. กฎหมายเกี่ยวกับการรักษาความสะอาดของชุมชน และสิ่งแวดล้อม </br>&nbsp;&nbsp; - พ.ร.บ.ควบคุมอาคาร พ.ศ. 2522 เช่น การสร้าง ดัดแปลง ต่อเติม รื้อถอน ต้องขออนุญาตต่อเจ้าพนักงานท้องถิ่น   </br>&nbsp;&nbsp; - พ.ร.บ. ส่งเสริมและรักษาสิ่งแวดล้อม พ.ศ. 2518 </br>&nbsp;&nbsp; - พ.ร.บ. โรคติดต่อ พ.ศ. 2522",
    },
    {
      type: "Other",
      detail: "Earthquake",
      bigHead: "วิธีเอาตัวรอดจากแผ่นดินไหว",
      image: "/images/Earthquake.jpg",
      body: "",
      head_h3: "10 วิธีเอาตัวรอดจากแผ่นดินไหว !",
      bodyForH3:
        "&nbsp; 1. ตั้งสติ อย่าแตกตื่นตกใจ พยายามควบคุมสติให้สงบ  </br>&nbsp; 2. อย่าวิ่งเข้าวิ่งออก เพราะส่วนใหญ่ได้รับบาดเจ็บจากการวิ่งเข้าออกบ้านนี่แหละ </br>&nbsp; 3. ห่างจากหน้าต่าง ประตู ระเบียง และหมอบอยู่ในส่วนของบ้านที่มีความแข็งแรงที่รับน้ำหนักได้dkiมาก </br>&nbsp; 4. หนีจากอคารสูง หารอยู่ในอาคารสูงให้รีบออกจากอาคารและหนีห่างสิ่งที่จะล้มทับได้ </br>&nbsp; 5. ห่างจากเสาไฟ สะพาน ท่อ ถ้าอยู่ในที่โล่งแจ้ง รวมทั้งสิ่งที่ห้อยแขวนต่างๆก็ต้องระวังด้วย </br>&nbsp; 6. อย่าจุดเทียน ไม้ขีดไฟ เพราะอาจมีแก๊สรั่วอยู่บริเวณนั้น ซึ่งทำให้เกิดประกายไฟได้ </br>&nbsp; 7. หยุดขับรถ และออกมานั่งหรือนอนข้างๆรถ ขนกว่าการสั่นสะเทือนจะหยุด </br>&nbsp; 8. ห้ามใช้ลิฟท์เด็ดขาด ถ้าอยู่ข้างในลิฟท์ให้ออกมาทันที </br>&nbsp; 9. ระวังสึนามิ ในกรณีที่อยู่ใกล้ชายหาด ให้อยู่ห่างจากชายฝั่ง เพราะอาจเกิดคลื่นสึนามิได้ </br>&nbsp; 10. ระวัง After shock  แม้จะหยุดการสั่งสะเทือนแล้ว อาจะเกิด After shock ตามมาเรื่อยๆควรระมัดระวังก่อน  ",
      head_h4: "",
      bodyForH4: "",
    },
    {
      type: "Other",
      detail: "Prepare",
      bigHead: "จัดกระเป๋าเดินทางไปต่างประเทศ",
      image: "/images/Prepare.jpg",
      body: "",
      head_h3: "เทคนิคการจัดกระเป๋าไปต่างประเทศ",
      bodyForH3:
        " &nbsp; 1. เตรียมเสื้อผ้าในแต่ละวันให้พร้อม ควรลองชุดที่จะใส่ เพื่อเป็นการดูว่าชุดที่เตรียมไปเหมาะกับสถานที่ที่เราจะไปเที่ยวรึป่าว </br>&nbsp; 2. จัดสกินแคร์ที่จำเป็น เลือกใส่ถุงไว้จะได้หาสะดวก และควรมีสกินแคร์ที่ช่วยละอาการแพ้ไปด้วย เพื่อเราแพ้สภาพอากาศ </br>&nbsp; 3. กระเป๋าติดตัว ควรเป็นกระเป๋าที่ไม่เล็กไม่ใหญ่จนเกินไปและต้องใส่ของที่จำเป็นได้ครบ เช่น กระเป๋าสตางค์ กล้อง มือถือ </br>&nbsp; 4. ควรไปสนามบินก่อนเวลา 1-2 ชั่วโมงเพื่อเลี่ยงการตกเครื่อง </br>&nbsp; 5. ประกันการเดินทาง สิ่งนี้ขาดไม่ได้ ไม่ว่าเราจะไปเที่ยว ต่างประเทศที่ไหนต้องสมัครประกันการเดินทางไว้เลย เพื่อความอุ่นใจ และเพื่อที่เวลาเกิดเหตุไม่คาดฝันขึ้นเราจะได้ไม่ลำบาก เที่ยวที่ไหนก็อุ่นใจ ในราคาสบายกระเป๋า",
      head_h4: "",
      bodyForH4: "",
    },
  ];

  var allContent = [
    {
      section:"Finance",
      content:["tax","invest"]
    },
    {
      section:"Healthy",
      content:["FirstAid","Stress","Organ","SkinHealth"]
    },
    {
      section:"Communication",
      content:["WriteEmail","Vocab","HowtoSpeak"]
    },
    {
      section:"Socializing",
      content:["Courtesy","Social"]
    },
    {
      section:"Food",
      content:["Menu","Nutrient"]
    },

    {
      section:"Learning",
      content:["GraphSum","Grade4"]
    },
    {
      section:"Manage",
      content:["ManageTime","Plan"]
    },

    {
      section:"Other",
      content:["Law","Earthquake","Prepare"]
    },

  ]
  window.onload = function () {
    // โหลดจำนวนไลค์จาก Local Storage
    const details = localStorage.getItem('detail');
    console.log(details);
    const section_content = localStorage.getItem('section');
    let currentLikes = parseInt(localStorage.getItem('likes')) || 0;
    document.getElementById("counter").textContent = currentLikes;
    showContent(section_content,details);
  };

  function showContent (section_content,details){
    let showContents = document.getElementById("showContentHere");
    showContents.innerHTML = "" ;
      contents.forEach(content_detail => {
        if ( content_detail.detail === details) {
          showContents.innerHTML += `
          <div class="left-side">
            <h1>${content_detail.bigHead}</h1>
            <br />
            <img src="${content_detail.image}" alt="Image" width="200" height="200" />
          </div>
          <hr class="divider" />
          <div class="right-side">
            <h3>${content_detail.head_h3}</h3>
            <p>
            ${content_detail.bodyForH3}
            </p>
            <br />
            <h4>
            ${content_detail.head_h4}
            </h4>
            <p>
            ${content_detail.bodyForH4}
            </p>
            <br />
            <br />
            <br />
          </div>
          `;
        }
    });
    
  }


